"Prevent accidental quitting" = "Impedir la sortida accidental del programa";
"Monthly" = "Mensualment";
"Check for update immediately" = "Comprobar actualitzacions inmediatament";
"Add Quicksilver to your login items" = "Afegir Quicksilver als seus elements d'inici de sessió";
"Download updates in the background" = "Descarregar actualitzacions en segon pla";
"Restart immediately" = "Reiniciar inmediatament";
"Warn before quitting" = "Avisar avans de sortir del programa";
"Normal" = "Normal";
"Run Setup" = "Configurar";
"Enable update checking" = "Activar la comprovació d'actualitzacions";
"Now" = "Ara";
"⌽" = "⌽";